RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tm.c
/*********************************************************************************************************//**
 * @brief Configure the TMx to measure an external PWM signal.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param CapInit: Point to a \ref TM_CaptureInitTypeDef structure that contains the configuration
 *                information.
 * @retval None
 * @note The CapInit->Channel can only be TM_CH_0 or TM_CH_1. CH2/CH3 are not supported since it cannot be
 *       the STI source to reset the counter.
 ************************************************************************************************************/
void TM_PwmInputInit(HT_TM_TypeDef* TMx, TM_CaptureInitTypeDef* CapInit)
{
  u8 Filter;
  TM_CHP_Enum OppositePol;
  TM_CHCCS_Enum OppositeSel;
  TM_CH_Enum OppositeChannel;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH_PWMI(CapInit->Channel));
  Assert_Param(IS_TM_CHP(CapInit->Polarity));
  Assert_Param(IS_TM_CHCCS(CapInit->Selection));
  Assert_Param(IS_TM_CHPSC(CapInit->Prescaler));
  #if (LIBCFG_TM_65X_66X_V1)
  #else
  Assert_Param(IS_TM_FILTER(CapInit->Filter));
  #endif

  /* Select the Opposite Input Polarity                                                                     */
  if (CapInit->Polarity == TM_CHP_NONINVERTED)
  {
    OppositePol = TM_CHP_INVERTED;
  }
  else
  {
    OppositePol = TM_CHP_NONINVERTED;
  }

  /* Select the Opposite Input                                                                              */
  if (CapInit->Selection == TM_CHCCS_DIRECT)
  {
    OppositeSel = TM_CHCCS_INDIRECT;
  }
  else
  {
    OppositeSel = TM_CHCCS_DIRECT;
  }

  /* Can only be TM_CH_0 or TM_CH_1. CH2/CH3 are not supported since it cannot be the STI source to         */
  /* reset the counter                                                                                      */
  if (CapInit->Channel == TM_CH_0)
  {
    OppositeChannel = TM_CH_1;
  }
  else
  {
    OppositeChannel = TM_CH_0;
  }

  #if (LIBCFG_TM_65X_66X_V1)
  Filter = FILTER_PROCESS(CapInit);
  #else
  Filter = CapInit->Filter;
  #endif

  /* Capture Channel Configuration                                                                          */
  _TM_CHx_Config(TMx, CapInit->Channel, CapInit->Polarity, CapInit->Selection, Filter);

  /* Set the Input Capture Prescaler value                                                                  */
  TM_CHPSCConfig(TMx, CapInit->Channel, CapInit->Prescaler);

  /* Opposite Channel Configuration                                                                         */
  _TM_CHx_Config(TMx, OppositeChannel, OppositePol, OppositeSel, Filter);

  /* Set the Input Capture Prescaler value                                                                  */
  TM_CHPSCConfig(TMx, OppositeChannel, CapInit->Prescaler);
}

/*********************************************************************************************************//**
 * @brief Fill each TimeBaseInit member with its default value.
 * @param TimeBaseInit: Point to a \ref TM_TimeBaseInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void TM_TimeBaseStructInit(TM_TimeBaseInitTypeDef* TimeBaseInit)
{
  /* Set the default configuration                                                                          */
  TimeBaseInit->CounterMode = TM_CNT_MODE_UP;
  TimeBaseInit->CounterReload = 0xFFFF;
  TimeBaseInit->Prescaler = 0x0000;
  TimeBaseInit->PSCReloadTime = TM_PSC_RLD_IMMEDIATE;
  #if (LIBCFG_MCTM0)
  TimeBaseInit->RepetitionCounter = 0;
  #endif
}

/*********************************************************************************************************//**
 * @brief Fill each OutInit member with its default value.
 * @param OutInit: Point to a \ref TM_OutputInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void TM_OutputStructInit(TM_OutputInitTypeDef* OutInit)
{
  /* Set the default configuration                                                                          */
  OutInit->Channel = TM_CH_0;
  OutInit->OutputMode = TM_OM_MATCH_NOCHANGE;
  OutInit->Control = TM_CHCTL_DISABLE;
  OutInit->Polarity = TM_CHP_NONINVERTED;
  #if (LIBCFG_MCTM0)
  OutInit->ControlN = TM_CHCTL_DISABLE;
  OutInit->PolarityN = TM_CHP_NONINVERTED;
  OutInit->IdleState = MCTM_OIS_LOW;
  OutInit->IdleStateN = MCTM_OIS_LOW;
  #endif
  OutInit->Compare = 0x0000;
  OutInit->AsymmetricCompare = 0x0000;
}

/*********************************************************************************************************//**
 * @brief Fill each CapInit member with its default value.
 * @param CapInit: Point to a \ref TM_CaptureInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void TM_CaptureStructInit(TM_CaptureInitTypeDef* CapInit)
{
  /* Set the default configuration                                                                          */
  CapInit->Channel = TM_CH_0;
  CapInit->Polarity = TM_CHP_NONINVERTED;
  CapInit->Selection = TM_CHCCS_DIRECT;
  CapInit->Prescaler = TM_CHPSC_OFF;
  #if (LIBCFG_TM_65X_66X_V1)
  CapInit->Fsampling = TM_CHFDIV_1;
  CapInit->Event = TM_CHFEV_OFF;
  #else
  CapInit->Filter = 0x00;
  #endif
}

/*********************************************************************************************************//**
 * @brief Enable or Disable TMx counter.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_Cmd(HT_TM_TypeDef* TMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the TM Counter                                                                                */
    TMx->CTR |= CTR_TME;
  }
  else
  {
    /* Disable the TM Counter                                                                               */
    TMx->CTR &= ~CTR_TME;
  }
}

#if (LIBCFG_TM_NO_ITI == 1)
#else
/*********************************************************************************************************//**
 * @brief Configure external clock mode of the TMx. Used ITIx as the clock source.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Iti: Trigger source.
 *        This parameter can be one of the following values:
 *        @arg TM_TRSEL_ITI0: Internal trigger 0
 *        @arg TM_TRSEL_ITI1: Internal trigger 1
 *        @arg TM_TRSEL_ITI2: Internal trigger 2
 * @retval None
 ************************************************************************************************************/
void TM_ItiExternalClockConfig(HT_TM_TypeDef* TMx, TM_TRSEL_Enum Iti)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_ITI(Iti));

  /* Select the Internal Trigger. Slave mode will be disable in this function                               */
  TM_StiConfig(TMx, Iti);

  /* Select the STIED as external clock source                                                              */
  TMx->MDCFR |= TM_SMSEL_STIED;
}
#endif

