RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tm.c
/*********************************************************************************************************//**
 * @brief Configure external clock mode of the TMx. Used CHx as the clock source.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Sel: Specify the channel source.
 *        This parameter can be one of the following values:
 *        @arg TM_TRSEL_TI0BED : TI0 both edge detector
 *        @arg TM_TRSEL_TI0S0 : Filtered timer input 0
 *        @arg TM_TRSEL_TI1S1 : Filtered timer input 1
 * @param Pol: Specify the CHx Polarity.
 *        This parameter can be one of the following values:
 *        @arg TM_CHP_NONINVERTED : active high.
 *        @arg TM_CHP_INVERTED    : active low.
 * @param Filter: Specify the filter value.
 *        This parameter must be a value between 0x0 and 0xF.
 * @retval None
 ************************************************************************************************************/
void TM_ChExternalClockConfig(HT_TM_TypeDef* TMx, TM_TRSEL_Enum Sel, TM_CHP_Enum Pol, u8 Filter)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_TRSEL_CH(Sel));
  Assert_Param(IS_TM_CHP(Pol));
  #if (LIBCFG_TM_65X_66X_V1)
  #else
  Assert_Param(IS_TM_FILTER(Filter));
  #endif

  /* Configure the Timer Input Clock Source                                                                 */
  if (Sel == TM_TRSEL_TI1S1)
  {
    _TM_CHx_Config(TMx, TM_CH_1, Pol, TM_CHCCS_DIRECT, Filter);
  }
  else
  {
    _TM_CHx_Config(TMx, TM_CH_0, Pol, TM_CHCCS_DIRECT, Filter);
  }

  /* Select the external clock source. Slave mode will be disable in this function                          */
  TM_StiConfig(TMx, Sel);

  /* Select the STIED as external clock source                                                              */
  TMx->MDCFR |= TM_SMSEL_STIED;
}

#if 0
/*********************************************************************************************************//**
 * @brief Configure external clock mode of the TMx. Used ETI as the clock source.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Psc: The external Trigger Prescaler.
 *        It can be one of the following values:
 *        @arg TM_ETIPSC_OFF : ETI prescaler off
 *        @arg TM_ETIPSC_2   : ETIP frequency divided by 2
 *        @arg TM_ETIPSC_4   : ETIP frequency divided by 4
 *        @arg TM_ETIPSC_8   : ETIP frequency divided by 8
 * @param Pol: The external trigger input polarity.
 *        It can be one of the following values:
 *        @arg TM_ETIPOL_NONINVERTED : Active high level or rising edge
 *        @arg TM_ETIPOL_INVERTED    : Active low level or falling edge
 * @param Filter: Filter for ETI input.
 *        This parameter must be a value between 0x00 and 0x0F
 * @retval None
 ************************************************************************************************************/
void TM_EtiExternalClockConfig(HT_TM_TypeDef* TMx, TM_ETIPSC_Enum Psc, TM_ETIPOL_Enum Pol, u8 Filter)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_ETIPSC(Psc));
  Assert_Param(IS_TM_ETIPOL(Pol));
  Assert_Param(IS_TM_FILTER(Filter));

  /* Configure the ETI Clock source                                                                         */
  TM_EtiConfig(TMx, Psc, Pol, Filter);

  /* Enable the external clock mode                                                                         */
  TMx->TRCFR |= TRCFR_ECME;
}

/*********************************************************************************************************//**
 * @brief Configure external trigger input (ETI) of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Psc: The external Trigger Prescaler.
 *        It can be one of the following values:
 *        @arg TM_ETIPSC_OFF : ETI prescaler off
 *        @arg TM_ETIPSC_2   : ETIP frequency divided by 2
 *        @arg TM_ETIPSC_4   : ETIP frequency divided by 4
 *        @arg TM_ETIPSC_8   : ETIP frequency divided by 8
 * @param Pol: The external trigger input polarity.
 *        It can be one of the following values:
 *        @arg TM_ETIPOL_NONINVERTED : Active high level or rising edge
 *        @arg TM_ETIPOL_INVERTED    : Active low level or falling edge
 * @param Filter: Filter for ETI input.
 *        This parameter must be a value between 0x00 and 0x0F
 * @retval None
 ************************************************************************************************************/
void TM_EtiConfig(HT_TM_TypeDef* TMx, TM_ETIPSC_Enum Psc, TM_ETIPOL_Enum Pol, u8 Filter)
{
  u32 wTrcfr;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_ETIPSC(Psc));
  Assert_Param(IS_TM_ETIPOL(Pol));
  Assert_Param(IS_TM_FILTER(Filter));

  /* Get TRCFR value with cleared ETI configuration bits                                                    */
  wTrcfr = TMx->TRCFR & TRCFR_ETI_CONF_MASK;

  /* Set the prescaler, filter and polarity for ETI input                                                   */
  wTrcfr |= (u32)Psc | Pol | ((u32)Filter << 8);

  /* Write to TMx TRCFR                                                                                     */
  TMx->TRCFR = wTrcfr;
}
#endif

/*********************************************************************************************************//**
 * @brief Configure prescaler of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Psc: Specify the prescaler value.
 * @param PscReloadTime: Specify the TM prescaler reload time.
 *        This parameter can be one of the following values:
 *        @arg TM_PSC_RLD_UPDATE    : The prescaler is loaded at the next update event.
 *        @arg TM_PSC_RLD_IMMEDIATE : The prescaler is loaded immediatly.
 * @retval None
 ************************************************************************************************************/
void TM_PrescalerConfig(HT_TM_TypeDef* TMx, u16 Psc, TM_PSC_RLD_Enum PscReloadTime)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_PSC_RLD(PscReloadTime));

  /* Set the prescaler value                                                                                */
  TMx->PSCR = Psc;

  /* Set the UEVG bit or not                                                                                */
  TMx->EVGR = PscReloadTime;
}

