RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tm.c
/*********************************************************************************************************//**
 * @brief Force the TMx CHnOREF waveform to active or inactive level.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param TM_CH_n: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 *        @arg TM_CH_4 : TM channel 4
 *        @arg TM_CH_5 : TM channel 5
 *        @arg TM_CH_6 : TM channel 6
 *        @arg TM_CH_7 : TM channel 7
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg TM_OM_FORCED_ACTIVE   : Forced active level on CH0OREF
 *        @arg TM_OM_FORCED_INACTIVE : Forced inactive level on CH0OREF.
 * @retval None
 ************************************************************************************************************/
void TM_ForcedOREF(HT_TM_TypeDef* TMx, TM_CH_Enum TM_CH_n, TM_OM_Enum ForcedAction)
{
  vu32* pCHnOCFR = ((vu32*)&TMx->CH0OCFR) + (TM_CH_n * 1);
#if (LIBCFG_PWM_8_CHANNEL)
  if ((TM_CH_n > TM_CH_3) && (TM_CH_n <= TM_CH_7) )
  {
    pCHnOCFR = ((vu32*)&TMx->CH4OCFR) + ((TM_CH_n -4) * 1);
  }
#endif

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(TM_CH_n));
  Assert_Param(IS_TM_OM_FORCED(ForcedAction));

  /* Configure The forced output mode                                                                       */
  *pCHnOCFR = (*pCHnOCFR & CHOCFR_CHOM_MASK) | ForcedAction;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the TMx CRR preload function.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_CRRPreloadCmd(HT_TM_TypeDef* TMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Set the CRR preload control bit                                                                      */
    TMx->CTR |= CTR_CRBE;
  }
  else
  {
    /* Reset the CRR preload control bit                                                                    */
    TMx->CTR &= ~CTR_CRBE;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the TMx CHxCCR preload function.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Channel: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 *        @arg TM_CH_4 : TM channel 4
 *        @arg TM_CH_5 : TM channel 5
 *        @arg TM_CH_6 : TM channel 6
 *        @arg TM_CH_7 : TM channel 7
 * @param NewState This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_CHCCRPreloadConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, ControlStatus NewState)
{
  vu32 *pOcfr = (vu32*)&TMx->CH0OCFR + Channel;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(Channel));
  Assert_Param(IS_CONTROL_STATUS(NewState));
#if (LIBCFG_PWM_8_CHANNEL)
  if ((Channel > TM_CH_3) && (Channel <= TM_CH_7))
  {
    u8 bOffset = Channel - 4;
    pOcfr = (vu32*)&TMx->CH4OCFR + bOffset;
  }
#endif
  /* Enable or disable the channel N CCR preload feature                                                    */
  if (NewState != DISABLE)
  {
    *pOcfr |= CHOCFR_CHPRE;
  }
  else
  {
    *pOcfr &= ~CHOCFR_CHPRE;
  }
}

#if 0
/*********************************************************************************************************//**
 * @brief Clear or Safeguard the CHxOREF signal when ETI is active.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Channel: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 * @param NewState This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_ClearOREFConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, ControlStatus NewState)
{
  vu32 *pOcfr = (vu32*)&TMx->CH0OCFR + Channel;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(Channel));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Enable or Disable the channel N clear Oref at ETI active function                                      */
  if (NewState != DISABLE)
  {
    *pOcfr |= CHOCFR_REFCE;
  }
  else
  {
    *pOcfr &= ~CHOCFR_REFCE;
  }
}
#endif

/*********************************************************************************************************//**
 * @brief Configure polarity of the TMx channel N.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Channel: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 *        @arg TM_CH_4 : TM channel 4
 *        @arg TM_CH_5 : TM channel 5
 *        @arg TM_CH_6 : TM channel 6
 *        @arg TM_CH_7 : TM channel 7
 * @param Pol: Specify the polarity of channel N.
 *        This parameter can be one of the following values:
 *        @arg TM_CHP_NONINVERTED : active high
 *        @arg TM_CHP_INVERTED    : active low
 * @retval None
 ************************************************************************************************************/
void TM_ChPolarityConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, TM_CHP_Enum Pol)
{
  u32 wChpolr;

