RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tm.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(Channel));
  Assert_Param(IS_TM_CHP(Pol));

  /* Set or reset the CHx polarity                                                                          */
  wChpolr = TMx->CHPOLR & (~(u32)(0x1 << (Channel << 1)));
  TMx->CHPOLR = wChpolr | (Pol << (Channel << 1));
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the single pulse immediate active function.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Channel: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 *        @arg TM_CH_4 : TM channel 4
 *        @arg TM_CH_5 : TM channel 5
 *        @arg TM_CH_6 : TM channel 6
 *        @arg TM_CH_7 : TM channel 7
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 * @note Must configure output mode to PWM1 or PWM2 before invoke this function.
 ************************************************************************************************************/
void TM_ImmActiveConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, ControlStatus NewState)
{
  vu32 *pOcfr = (vu32*)&TMx->CH0OCFR + Channel;

#if (LIBCFG_PWM_8_CHANNEL)
  if ((Channel > TM_CH_3) && (Channel <= TM_CH_7) )
  {
    u8 bOffset = Channel - 4;
    pOcfr = (vu32*)&TMx->CH4OCFR + bOffset;
  }
#endif
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(Channel));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Enable or disable the channel N clear CHxOREF at ETI active function                                   */
  if (NewState != DISABLE)
  {
    *pOcfr |= CHOCFR_IMAE;
  }
  else
  {
    *pOcfr &= ~CHOCFR_IMAE;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the TMx channel N.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Channel: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 *        @arg TM_CH_4 : TM channel 4
 *        @arg TM_CH_5 : TM channel 5
 *        @arg TM_CH_6 : TM channel 6
 *        @arg TM_CH_7 : TM channel 7
 * @param Control: This parameter can be TM_CHCTL_ENABLE or TM_CHCTL_DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_ChannelConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, TM_CHCTL_Enum Control)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(Channel));
  Assert_Param(IS_TM_CHCTL(Control));

  /* Reset the CHxE Bit                                                                                     */
  TMx->CHCTR &= ~(u32)(0x1 << (Channel << 1));

  /* Set or reset the CHxE Bit                                                                              */
  TMx->CHCTR |= (u32)Control << (Channel << 1);
}

/*********************************************************************************************************//**
 * @brief Configure output mode of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Channel: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 *        @arg TM_CH_4 : TM channel 4
 *        @arg TM_CH_5 : TM channel 5
 *        @arg TM_CH_6 : TM channel 6
 *        @arg TM_CH_7 : TM channel 7
 * @param Mod: Specify the TM output mode.
 *        This parameter can be one of the following values:
 *        @arg TM_OM_MATCH_NOCHANGE  : Output dont change on match
 *        @arg TM_OM_MATCH_INACTIVE  : Output inactive on compare match
 *        @arg TM_OM_MATCH_ACTIVE    : Output active on compare match
 *        @arg TM_OM_MATCH_TOGGLE    : Output toggle on compare match
 *        @arg TM_OM_FORCED_INACTIVE : Output forced inactive
 *        @arg TM_OM_FORCED_ACTIVE   : Output forced active
 *        @arg TM_OM_PWM1            : PWM1 mode
 *        @arg TM_OM_PWM2            : PWM2 mode
 *        @arg TM_OM_ASYMMETRIC_PWM1 : Asymmetric PWM1 mode
 *        @arg TM_OM_ASYMMETRIC_PWM2 : Asymmetric PWM2 mode
 * @retval None
 * @note This function disables the selected channel before changing the output mode.
 ************************************************************************************************************/
void TM_OutputModeConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, TM_OM_Enum Mod)
{
  vu32 *pOcfr = (vu32*)&TMx->CH0OCFR + Channel;

#if (LIBCFG_PWM_8_CHANNEL)
  if ((Channel > TM_CH_3) && (Channel <= TM_CH_7) )
  {
    u8 bOffset = Channel - 4;
    pOcfr = (vu32*)&TMx->CH4OCFR + bOffset;
  }
#endif
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(Channel));
  Assert_Param(IS_TM_OM(Mod));
#if (LIBCFG_PWM_8_CHANNEL)
  if ((Channel > TM_CH_3) && (Channel <= TM_CH_7) )
  {
    Assert_Param(IS_TM_OM_NOASYM(Mod));
  }
#endif

  /* Disable the channel: Reset the CHxE Bit                                                                */
  TMx->CHCTR &= ~(u32)(0x1 << (Channel << 1));

  /* Selects the TM output mode                                                                             */
  *pOcfr = (*pOcfr & CHOCFR_CHOM_MASK) | Mod;
}

