RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tm.c
/*********************************************************************************************************//**
 * @brief Enable or Disable update event of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param NewState: This parameter can be ENABLE (default) or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_UpdateCmd(HT_TM_TypeDef* TMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState == DISABLE)
  {
    /* Set the update disable bit                                                                           */
    TMx->CNTCFR |= CNTCFR_UEVDIS;
  }
  else
  {
    /* Reset the update disable bit                                                                         */
    TMx->CNTCFR &= ~CNTCFR_UEVDIS;
  }
}

/*********************************************************************************************************//**
 * @brief Configure UEVG interrupt function of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param NewState: This parameter can be one of the following value:
 *    @arg ENABLE  : Default value. Any of the following events will generate an update event interrupt:
 *                   - Counter overflow/underflow
 *                   - Setting the UEVG bit
 *                   - Update generation through the slave restart mode
 *    @arg DISABLE : Only counter overflow/underflow generations an update event interrupt.
 * @retval None
 ************************************************************************************************************/
void TM_UEVG_IntConfig(HT_TM_TypeDef* TMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState == DISABLE)
  {
    /* Set the UEVG interrupt disable bit                                                                   */
    TMx->CNTCFR |= CNTCFR_UGDIS;
  }
  else
  {
    /* Reset the UEVG interrupt disable bit                                                                 */
    TMx->CNTCFR &= ~CNTCFR_UGDIS;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable hall sensor interface of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_HallInterfaceCmd(HT_TM_TypeDef* TMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Set the CH0SRC Bit                                                                                   */
    TMx->CH0ICFR |= CH0ICFR_CH0SRC;
  }
  else
  {
    /* Reset the CH0SRC Bit                                                                                 */
    TMx->CH0ICFR &= ~CH0ICFR_CH0SRC;
  }
}

/*********************************************************************************************************//**
 * @brief Select single pulse mode of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_SinglePulseModeCmd(HT_TM_TypeDef* TMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    TMx->MDCFR |= MDCFR_SPMSET;
  }
  else
  {
    TMx->MDCFR &= ~MDCFR_SPMSET;
  }
}

/*********************************************************************************************************//**
 * @brief Select master trigger output source of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Sel: Specify the master trigger output source.
 *        This parameter can be as follow:
 *        @arg TM_MMSEL_RESET   : Send trigger signal when S/W setting UEVG or slave restart
 *        @arg TM_MMSEL_ENABLE  : The counter enable signal is used as trigger output.
 *        @arg TM_MMSEL_UPDATE  : The update event is used as trigger output.
 *        @arg TM_MMSEL_CH0CC   : Channel 0 capture or compare match occurred as trigger output.
 *        @arg TM_MMSEL_CH0OREF : The CH0OREF signal is used as trigger output.
 *        @arg TM_MMSEL_CH1OREF : The CH1OREF signal is used as trigger output.
 *        @arg TM_MMSEL_CH2OREF : The CH2OREF signal is used as trigger output.
 *        @arg TM_MMSEL_CH3OREF : The CH3OREF signal is used as trigger output.
 *        @arg TM_MMSEL_CH4OREF : The CH4OREF signal is used as trigger output.
 *        @arg TM_MMSEL_CH5OREF : The CH5OREF signal is used as trigger output.
 *        @arg TM_MMSEL_CH6OREF : The CH6OREF signal is used as trigger output.
 *        @arg TM_MMSEL_CH7OREF : The CH7OREF signal is used as trigger output.
 * @retval None
 ************************************************************************************************************/
void TM_MMSELConfig(HT_TM_TypeDef* TMx, TM_MMSEL_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_MMSEL(Sel));

  /* Select the MTO source                                                                                  */
  TMx->MDCFR = (TMx->MDCFR & MDCFR_MMSEL_MASK) | Sel;
}

