RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tm.c
/*********************************************************************************************************//**
 * @brief Select slave mode of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Sel: Specify the timer slave mode.
 *        This parameter can be one of the following values:
 *        @arg TM_SMSEL_RESTART : Slave restart counter mode.
 *        @arg TM_SMSEL_PAUSE   : Slave pause counter mode.
 *        @arg TM_SMSEL_TRIGGER : Slave trigger counter start mode.
 *        @arg TM_SMSEL_STIED   : Used rising edge of STI as prescaler clock source.
 * @retval None
 ************************************************************************************************************/
void TM_SlaveModeConfig(HT_TM_TypeDef* TMx, TM_SMSEL_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_SLAVE_MODE(Sel));

  /* Select the slave mode                                                                                  */
  TMx->MDCFR = (TMx->MDCFR & MDCFR_SMSEL_MASK) | Sel;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the master & slave TMx synchronous function.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_TimSyncCmd(HT_TM_TypeDef* TMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Set the TSE Bit                                                                                      */
    TMx->MDCFR |= MDCFR_TSE;
  }
  else
  {
    /* Reset the TSE Bit                                                                                    */
    TMx->MDCFR &= ~MDCFR_TSE;
  }
}

/*********************************************************************************************************//**
 * @brief Set counter register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Counter: Specify the counter register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetCounter(HT_TM_TypeDef* TMx, u16 Counter)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Set the Counter Register value                                                                         */
  TMx->CNTR = Counter;
}

/*********************************************************************************************************//**
 * @brief Set counter reload register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Reload: Specify the counter reload register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetCounterReload(HT_TM_TypeDef* TMx, u16 Reload)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Set the counter reload register value                                                                  */
  TMx->CRR = Reload;
}

/*********************************************************************************************************//**
 * @brief Set channel n capture/compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param TM_CH_n: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 *        @arg TM_CH_4 : TM channel 4
 *        @arg TM_CH_5 : TM channel 5
 *        @arg TM_CH_6 : TM channel 6
 *        @arg TM_CH_7 : TM channel 7
 * @param Cmp: Specify the CH0CCR register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetCaptureCompare(HT_TM_TypeDef* TMx, TM_CH_Enum TM_CH_n, u16 Cmp)
{
  vu32* pCHnCCR = ((vu32*)&TMx->CH0CCR) + (TM_CH_n * 1);
  #if (LIBCFG_PWM_8_CHANNEL)
  if ((TM_CH_n > TM_CH_3) && (TM_CH_n <= TM_CH_7) )
  {
    pCHnCCR = ((vu32*)&TMx->CH4CR) + ((TM_CH_n - 4) * 1);
  }
  #endif
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(TM_CH_n));

  /* Set the CHnCCR register new value                                                                      */
  *pCHnCCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel n asymmetric compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param TM_CH_n: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 * @param Cmp: Specify the CH0ACR register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetAsymmetricCompare(HT_TM_TypeDef* TMx, TM_CH_Enum TM_CH_n, u16 Cmp)
{
  vu32* pCHnACR = ((vu32*)&TMx->CH0ACR) + (TM_CH_n * 1);

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(TM_CH_n));

  /* Set the CHnACR register new value                                                                      */
  *pCHnACR = Cmp;
}

