RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tm.c
/*********************************************************************************************************//**
 * @brief Configure input capture prescaler.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Channel: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 * @param Psc: Specify the input capture prescaler new value.
 *        This parameter can be one of the following values:
 *        @arg TM_CHPSC_OFF : No prescaler
 *        @arg TM_CHPSC_2   : Capture is done once every 2 events
 *        @arg TM_CHPSC_4   : Capture is done once every 4 events
 *        @arg TM_CHPSC_8   : Capture is done once every 8 events
 * @retval None
 ************************************************************************************************************/
void TM_CHPSCConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, TM_CHPSC_Enum Psc)
{
  vu32 *pIcfr = (vu32*)&TMx->CH0ICFR + Channel;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(Channel));
  Assert_Param(IS_TM_CHPSC(Psc));

  /* Reset the CHxPSC bits                                                                                  */
  *pIcfr &= CHICFR_CHPSC_MASK;

  /* Set the capture input prescaler value                                                                  */
  *pIcfr |= Psc;
}

/*********************************************************************************************************//**
 * @brief Set clock division value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Div: Specify the clock division value.
 *        This parameter can be one of the following value:
 *        @arg TM_CKDIV_OFF : fDTS = fCLKIN
 *        @arg TM_CKDIV_2   : fDTS = fCLKIN / 2
 *        @arg TM_CKDIV_4   : fDTS = fCLKIN / 4
 *        @arg TM_CKDIV_8   : fDTS = fCLKIN / 8
 * @retval None
 ************************************************************************************************************/
void TM_CKDIVConfig(HT_TM_TypeDef* TMx, TM_CKDIV_Enum Div)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CKDIV(Div));

  /* Reset the CKDIV Bits                                                                                   */
  TMx->CNTCFR &= CNTCFR_CKDIV_MASK;

  /* Set the CKDIV value                                                                                    */
  TMx->CNTCFR |= Div;
}

/*********************************************************************************************************//**
 * @brief Get channel n capture/compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param TM_CH_n: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 * @retval Value of CH0CCR register
 ************************************************************************************************************/
u32 TM_GetCaptureCompare(HT_TM_TypeDef* TMx, TM_CH_Enum TM_CH_n)
{
  vu32* pCHnCCR = ((vu32*)&TMx->CH0CCR) + (TM_CH_n * 1);

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(TM_CH_n));

  #if (LIBCFG_PWM_8_CHANNEL)
  if ((TM_CH_n > TM_CH_3) && (TM_CH_n <= TM_CH_7))
  {
    pCHnCCR = ((vu32*)&TMx->CH4CR) + ((TM_CH_n - 4) * 1);
  }
  #endif

  /* Get the CHnCCR register value                                                                          */
  return (*pCHnCCR);
}

/*********************************************************************************************************//**
 * @brief Get counter value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @retval Value of Counter register
 ************************************************************************************************************/
u32 TM_GetCounter(HT_TM_TypeDef* TMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Get the Counter Register value                                                                         */
  return TMx->CNTR;
}

/*********************************************************************************************************//**
 * @brief Get prescaler value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @retval Value of Prescaler register
 ************************************************************************************************************/
u32 TM_GetPrescaler(HT_TM_TypeDef* TMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Get the Prescaler Register value                                                                       */
  return TMx->PSCR;
}

/*********************************************************************************************************//**
 * @brief Generate TMx events.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param TM_EVENT: Stores the event source.
 *        This parameter can be any combination of following:
 *        @arg TM_EVENT_CH0CC     : Timer Capture/compare 0 event
 *        @arg TM_EVENT_CH1CC     : Timer Capture/compare 1 event
 *        @arg TM_EVENT_CH2CC     : Timer Capture/compare 2 event
 *        @arg TM_EVENT_CH3CC     : Timer Capture/compare 3 event
 *        @arg TM_EVENT_CH4CC     : Timer Compare 4 event
 *        @arg TM_EVENT_CH5CC     : Timer Compare 5 event
 *        @arg TM_EVENT_CH6CC     : Timer Compare 6 event
 *        @arg TM_EVENT_CH7CC     : Timer Compare 7 event
 *        @arg TM_EVENT_UEV       : Timer update event
 *        @arg TM_EVENT_UEV2      : Timer update event 2
 *        @arg TM_EVENT_TEV       : Timer trigger event
 *        @arg TM_EVENT_BRKEV     : Timer break event
 * @retval None
 ************************************************************************************************************/
void TM_GenerateEvent(HT_TM_TypeDef* TMx, u32 TM_EVENT)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_EVENT(TM_EVENT));

  /* Set the event sources                                                                                  */
  TMx->EVGR = TM_EVENT;
}

