RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tm.c
/*********************************************************************************************************//**
 * @brief Check whether the TMx interrupt has occurred.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param TM_INT: Specify the TM interrupt source to be checked.
 *        This parameter can be one of the following values:
 *        @arg TM_INT_CH0CC     : TM Capture/compare 0 interrupt
 *        @arg TM_INT_CH1CC     : TM Capture/compare 1 interrupt
 *        @arg TM_INT_CH2CC     : TM Capture/compare 2 interrupt
 *        @arg TM_INT_CH3CC     : TM Capture/compare 3 interrupt
 *        @arg TM_INT_CH4CC     : TM Compare 4 interrupt
 *        @arg TM_INT_CH5CC     : TM Compare 5 interrupt
 *        @arg TM_INT_CH6CC     : TM Compare 6 interrupt
 *        @arg TM_INT_CH7CC     : TM Compare 7 interrupt
 *        @arg TM_INT_UEV       : TM update interrupt
 *        @arg TM_INT_UEV2      : TM update 2 interrupt
 *        @arg TM_INT_TEV       : TM trigger interrupt
 *        @arg TM_INT_BRKEV     : TM break interrupt
 * @retval The new state of the TM_INT(SET or RESET)
 ************************************************************************************************************/
FlagStatus TM_GetIntStatus(HT_TM_TypeDef* TMx, u32 TM_INT)
{
  u32 itstatus, itenable;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_GET_INT(TM_INT));

  itstatus = TMx->INTSR & TM_INT;
  itenable = TMx->DICTR & TM_INT;

  if ((itstatus != 0) && (itenable != 0))
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Clear interrupt pending bits of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param TM_INT: Specify the TM interrupt to be cleared.
 *        This parameter can be any combination of the following values:
 *        @arg TM_INT_CH0CC     : TM Capture/compare 0 interrupt
 *        @arg TM_INT_CH1CC     : TM Capture/compare 1 interrupt
 *        @arg TM_INT_CH2CC     : TM Capture/compare 2 interrupt
 *        @arg TM_INT_CH3CC     : TM Capture/compare 3 interrupt
 *        @arg TM_INT_CH4CC     : TM Compare 4 interrupt
 *        @arg TM_INT_CH5CC     : TM Compare 5 interrupt
 *        @arg TM_INT_CH6CC     : TM Compare 6 interrupt
 *        @arg TM_INT_CH7CC     : TM Compare 7 interrupt
 *        @arg TM_INT_UEV       : TM update interrupt
 *        @arg TM_INT_UEV2      : TM update 2 interrupt
 *        @arg TM_INT_TEV       : TM trigger interrupt
 *        @arg TM_INT_BRKEV     : TM break interrupt
 * @retval None
 ************************************************************************************************************/
void TM_ClearIntPendingBit(HT_TM_TypeDef* TMx, u32 TM_INT)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_INT(TM_INT));

  /* Clear the interrupt pending Bit                                                                        */
  TMx->INTSR = ~TM_INT;

  /*--------------------------------------------------------------------------------------------------------*/
  /* DSB instruction is added in this function to ensure the write operation which is for clearing interrupt*/
  /* flag is actually completed before exiting ISR. It prevents the NVIC from detecting the interrupt again */
  /* since the write register operation may be pended in the internal write buffer of Cortex-Mx when program*/
  /* has exited interrupt routine. This DSB instruction may be masked if this function is called in the     */
  /* beginning of ISR and there are still some instructions before exiting ISR.                             */
  /*--------------------------------------------------------------------------------------------------------*/
  __DSB();
}

/*********************************************************************************************************//**
 * @brief Disable slave mode to clock the prescaler directly with the internal clock.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @retval None
 ************************************************************************************************************/
void TM_InternalClockConfig(HT_TM_TypeDef* TMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Disable slave mode to clock the prescaler directly with the internal clock                             */
  TMx->MDCFR &= MDCFR_SMSEL_MASK;
}

#if (LIBCFG_PDMA)
/*********************************************************************************************************//**
 * @brief Select Channel Capture/Compare PDMA event of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Selection: This parameter can be TM_CHCCDS_CHCCEV or TM_CHCCDS_UEV.
 * @retval None
 ************************************************************************************************************/
void TM_CHCCDSConfig(HT_TM_TypeDef* TMx, TM_CHCCDS_Enum Selection)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CHCCDS(Selection));

  if (Selection != TM_CHCCDS_CHCCEV)
  {
    TMx->CTR |= CTR_CHCCDS;
  }
  else
  {
    TMx->CTR &= ~CTR_CHCCDS;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified PDMA requests of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param TM_PDMA: Specify the TM PDMA requests to be enabled or disabled.
 *        This parameter can be any combination of the following values:
 *        @arg TM_PDMA_CH0CC     : TM Capture/compare 0 PDMA request
 *        @arg TM_PDMA_CH1CC     : TM Capture/compare 1 PDMA request
 *        @arg TM_PDMA_CH2CC     : TM Capture/compare 2 PDMA request
 *        @arg TM_PDMA_CH3CC     : TM Capture/compare 3 PDMA request
 *        @arg TM_PDMA_UEV       : TM update PDMA request
 *        @arg TM_PDMA_UEV2      : TM update 2 PDMA request
 *        @arg TM_PDMA_TEV       : TM trigger PDMA request
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_PDMAConfig(HT_TM_TypeDef* TMx, u32 TM_PDMA, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_PDMA(TM_PDMA));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the PDMA request                                                                              */
    TMx->DICTR |= TM_PDMA;
  }
  else
  {
    /* Disable the PDMA request                                                                             */
    TMx->DICTR &= ~TM_PDMA;
  }
}
#endif
/**
  * @}
  */

/* Private functions ---------------------------------------------------------------------------------------*/
/** @defgroup TM_Private_Functions TM private functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Configure the CHx as input.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Ch: Specify the TM Channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 * @param Pol: The input polarity.
 *        This parameter can be one of the following values:
 *        @arg TM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg TM_CHP_INVERTED    : Active low level or falling edge
 * @param Sel: Specify the input to be used.
 *        This parameter can be one of the following values:
 *        @arg TM_CHCCS_DIRECT   : TM CHxI is mapped on CHx.
 *        @arg TM_CHCCS_INDIRECT : TM CH1I is mapped on CH0 (or CH0I->CH1 or CH2I->CH3 or CH3I->CH2).
 *        @arg TM_CHCCS_TRCED    : TM CHx is mapped on TRC.
 * @param Filter: Specify the input capture filter.
 *        This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 ************************************************************************************************************/
static void _TM_CHx_Config(HT_TM_TypeDef* TMx, TM_CH_Enum Ch, TM_CHP_Enum Pol, TM_CHCCS_Enum Sel, u8 Filter)
{
  vu32* pIcfr = (vu32*)&TMx->CH0ICFR + Ch;
  u32 wIcfr, wChpolr;

  /* Disable the channel N: reset the CHxE bit                                                              */
  TMx->CHCTR &= ~((u32)0x1 << (Ch << 1));

  wIcfr = *pIcfr;
  wChpolr = TMx->CHPOLR;

  /* Select the input and set the filter                                                                    */
  wIcfr &= CHICFR_CHCCS_MASK & CHICFR_CHF_MASK;
  wIcfr |= Sel | Filter;
  *pIcfr = wIcfr;

  /* Select the polarity bit                                                                                */
  wChpolr &= ~((u32)0x1 << (Ch << 1));
  wChpolr |= (u32)Pol << (Ch << 1);
  TMx->CHPOLR = wChpolr;

  /* Set the CHxE Bit                                                                                       */
  TMx->CHCTR |= (u32)0x1 << (Ch << 1);
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
